Repository: OpenChain-Project/Reference-Material
Catalog: Training-Slides/Official/1.0/ko/Translation-Tools/Curriculum-Translation-KR-level2.tmx
Source language: en_us
Languages: ko

source: This slide explains the big picture of what Open Source code scanning tools are, how they work, and where a new user can start to gather knowledge about the subject.
ko: 이 슬라이드는 오픈 소스 코드 스캐닝 도구가 무엇인지, 어떻게 작동하는지, 새로운 사용자가 이 주제에 대한 지식을 어디에서 수집 할 수 있는지에 대한 큰 그림을 설명합니다.

source: This slide explains the “big picture” of copyright in software.
ko: 이 슬라이드는 소프트웨어의 저작권에 대한 "큰 그림"을 설명합니다.

source: This slide explains what is a “license.” This is different to a contract under US law.
ko: 이 슬라이드는 "라이선스"가 무엇인지 설명합니다. 이는 미국 법상의 계약과 다릅니다.

source: This slide explains when FOSS obligations are “triggered.” FOSS licenses are copyright licenses and the basic compliance trigger is when you distribute code to another legal entity.
ko: 이 슬라이드는 FOSS 의무가 "발생"되는 경우를 설명합니다. FOSS 라이선스는 저작권 라이선스이며 기본 컴플라이언스 의무 발생 시기는 코드를 다른 주체에게 배포할때입니다.

source: This slide explains ”permissive” FOSS licenses, the most basic type of FOSS license, which usually have minimal requirements.
ko: 이 슬라이드는 일반적으로 최소한의 요구 사항이있는 가장 기본적인 유형의 FOSS 라이선스 인 "permissive" FOSS 라이선스를 설명합니다.

source: This slide helps explain what the OpenChain Curriculum and these slides are for.
ko: 이 슬라이드는 OpenChain 커리큘럼과 슬라이드의 용도를 설명합니다.

source: This slide is about how the use of FOSS components is a consideration for your compliance.
ko: 이 슬라이드는 FOSS 컴포넌트를 사용하면서 컴플라이언스를 위해 고려해야 할 사항에 관한 것입니다.

source: This slide is an overview of the steps that a larger enterprise might use for their process.
ko: 이 슬라이드는 대기업이 프로세스에 사용할 수 있는 단계에 대한 개요입니다.

source: This slide is intended to help a company identify where their internal FOSS policy is located in the company documentation.
ko: 이 슬라이드는 회사의 내부 FOSS 정책이 회사 문서의 어디에 있는지 식별 할 수 있도록 돕기위한 것입니다.

source: This slide is relevant to providing either a single three hour training session or explaining how a series of shorter sessions focused on “per chapter” training will work.
ko: 이 슬라이드는 한번의 3시간 교육 세션을 제공하거나 "장당" 교육에 초점을 맞춘 일련의 짧은 세션이 어떻게 구성되었는지를 설명합니다.

source: This slide outlines the key developer guidelines necessary for a high quality compliance approach.
ko: 이 슬라이드는 우수한 컴플라이언스 방법에 필요한 핵심 개발자 지침을 간략하게 설명합니다.

source: This slide provides the “big picture” about what FOSS licenses do.
ko: 이 슬라이드는 FOSS 라이선스에 대한 "큰 그림"을 제공합니다.

source: This slides explains how to anticipate compliance process requirements.
ko: 이 슬라이드는 컴플라이언스 프로세스 요구사항을 어떻게 예측하는지에 대해 설명합니다.

source: This slides explains multi-licensing.
ko: 이 슬라이드는 다중 라이선싱에 대해 설명합니다.

source: This slides explains that development tools may do some of these actions “behind the scene”, and this is an area that companies should be aware of.
ko: 이 슬라이드는 개발 도구가 "내부적으로" 이러한 작업 중 일부를 수행할 수 있음을 설명합니다. 이것은 기업이 알아야 할 영역입니다.

source: This slides explains the boundaries of what can be in a license.
ko: 이 슬라이드는 라이선스에 포함될 수있는 경계를 설명합니다.

source: This slides outlines what incorporation means when using FOSS.
ko: 이 슬라이드는 FOSS를 사용할 때 결합의 의미를 설명합니다.

source: This slides outlines what linking means when using FOSS.
ko: 이 슬라이드는 FOSS를 사용할 때 링킹의 의미를 설명합니다.

source: This slides outlines what modification means when using FOSS.
ko: 이 슬라이드는 FOSS를 사용할 때 수정의 의미를 설명합니다.

source: This slides outlines what translation means when using FOSS.
ko: 이 슬라이드는 FOSS를 사용할 때 번역의 의미를 설명합니다.

source: This step could be a function of an entity providing oversight for the overall FOSS review process.
ko: 이 단계는 전체 FOSS 리뷰 프로세스에 대한 감독을 제공하는 하나의 실체(entity) 기능일 수 있습니다.

source: This step may be closely linked with the previous step (Resolving Audit Issues).
ko: 이 단계는 이전 단계 (검사 문제 해결)와 밀접하게 연관될 수 있습니다.

source: This step may have been initiated by one of the events listed in “prerequisites.” For example, a development team may have initiated a request (or initiated a FOSS Review).
ko: 이 단계는 "전제조건(prerequisites)"에 나열된 이벤트 중 하나에 의해 시작되었을 수 있습니다. 예를 들어 개발팀이 요청을 시작하였거나 FOSS 리뷰를 시작했을 수 있습니다.

source: This type of failure can be avoided by:
ko: 이러한 유형의 실패는 다음과 같은 방법으로 방지할 수 있다:

source: This type of failure can be prevented by implementing blocks in approvals in the FOSS compliance process
ko: 이런 유형의 실패는 FOSS 컴플라이언스 프로세스 내 승인 과정에서 블럭을 구현함으로써 예방할 수 있다.

source: This type of failure can be prevented by:
ko: 이러한 유형의 오류는 다음과 같은 방법으로 예방할 수 있다:

source: This type of failure can be prevented through education
ko: 이러한 유형의 실패는 교육을 통해 예방할 수 있다.

source: This type of failure can be avoided
ko: 이러한 유형의 실패는 엔지니어링 부서가 FOSS 소스 코드의 채택을 아직 결정하지 않았더라도 FOSS 리뷰 요청을 조기에 시작함으로써 방지할 수 있다.

source: This type of failure can be avoided by
ko: 이러한 유형의 실패는 검사 보고서가 완료되지 않은 경우 컴플라이언스 티켓 해결(i.e. Close)을 허용하지 않음으로 방지할 수 있다.

source: This type of failure can be avoided by adding a verification step into the compliance process to ensure that source code for modifications are published, rather than only the original source code for the FOSS component
ko: 이러한 유형의 실패는 FOSS 컴포넌트의 원본 소스 코드가 아닌 수정 소스 코드가 공개되고 있음을 보장하기 위한 확인 단계를 컴플라이언스 프로세스에 추가함으로 방지할 수 있다.

source: This type of failure can be avoided by adding a verification step into the compliance process to ensure that the accompanying source code for the binary version is being published.
ko: 이러한 유형의 실패는 바이너리 버전에 맞는 동반하는 소스 코드가 공개되고 있음을 보장하기 위한 확인 단계를 컴플라이언스 프로세스에 추가함으로 방지할 수 있다.

source: This type of failure can be avoided by initiating FOSS Review requests early even if engineering did not yet decide on the adoption of the FOSS source code
ko: 이러한 유형의 실패는 엔지니어링 부서가 FOSS 소스 코드의 채택을 아직 결정하지 않았더라도 FOSS 리뷰 요청을 조기에 시작함으로써 방지할 수 있다.

source: This type of failure can be avoided by making source code capture and publishing a checklist item in the product release cycle before the product becomes available in the market place.
ko: 이러한 유형의 실패는 제품이 시장에 출시되기 전에 제품 출시 주기에 맞추어 소스 코드를 캡쳐하고 체크리스트 항목을 게시함으로 방지할 수 있다.

source: This type of failure can be avoided by not allowing a compliance ticket to be resolved (i.e. closed) if the audit report is not finalized.
ko: 이러한 유형의 실패는 검사 보고서가 완료되지 않은 경우 컴플라이언스 티켓 해결(i.e. Close)을 허용하지 않음으로 방지할 수 있다.

source: This type of failure can be avoided by offering training to Engineering staff on the company’s FOSS policies and processes.
ko: 이러한 유형의 실패는 회사의 FOSS 정책 및 프로세스에 대하여 엔지니어링 직원에게 교육을 제공함으로 방지할 수 있다.

source: This type of failure can be discovered by scanning or auditing the source code for possible matches with:
ko: 이러한 유형의 오류는 다음과 일치하는 소스 코드를 스캔하거나 검사하여 발견할 수 있다:

source: This type of failure can be discovered using a dependency tracking tool that shows any linking between different software components.
ko: 이러한 유형의 실패는 서로 다른 컴포넌트간의 링킹을 보여주는 종속성 추적 도구(dependency tracking tool)를 사용하여 발견할 수 있다.

source: This type of failure can be discovered using the audits or scans to identify and analyze the source code you introduced to the FOSS component.
ko: 이러한 유형의 실패는 검사 또는 스캔을 사용하여 FOSS 컴포넌트에 도입한 소스 코드를 식별하고 분석하여 발견할 수 있다.

source: This type of failure may be detected using dependency tracking tools or reviews of architecture.
ko: 이런 유형의 실패는 종속성 추적 도구 또는 아키텍처 리뷰를 통해 발견할 수 있습니다.

source: This type of failure may be discovered through auditing source code introduced into the FOSS component.
ko: 이런 유형의 실패는 FOSS 컴포넌트에 추가된 소스 코드를 검사함으로 발견 할 수 있습니다.

source: This type of failure occurs as a result of linking software with conflicting or incompatible licenses.
ko: 이러한 유형의 실패는 충돌하거나 양립가능하지 않는 라이선스하의 소프트웨어와 링킹한 결과로 발생합니다.

source: This type of failure occurs during the development process when engineers add FOSS code into source code that is intended to be proprietary in conflict with the FOSS policy.
ko: 이러한 유형의 실패는 개발 프로세스 중에 엔지니어가 FOSS정책에 위반하여 독점화할 소스 코드에 FOSS 코드를 추가할 때 발생한다.

source: This type of failures can be avoided by:
ko: 이러한 유형의 실패는 다음과 같은 방법으로 방지할 수 있다:

source: To gather and analyze information regarding FOSS usage and to produce appropriate guidance.
ko: FOSS 사용에 관한 정보를 수집 및 분석하고 적절한 가이드를 작성하는 것입니다.

source: Track progress of all FOSS compliance activities
ko: 모든 FOSS 컴플라이언스 활동의 진행 사항을 추적.

source: Tracking FOSS software within the development process
ko: 개발절차 내에서 FOSS 소프트웨어를 추적

source: Trade secrets: protects valuable confidential information
ko: 영업 비밀: 가치있는 기밀 정보 보호

source: Trademarks: protects marks (word, logos, slogans, color, etc.) that identify the source of the product
ko: 상표 : 제품의 출처를 식별하는 표시(단어, 로고, 슬로건, 색상 등)를 보호

source: Training
ko: 교육

source: Translate the material
ko: 자료 번역

source: Translating Chinese to English
ko: 중국어를 영어로 번역

source: Translation
ko: 번역

source: Translation is when you transform the code from one state to another.
ko: 번역은 코드를 한 상태에서 다른 상태로 변환하는 것입니다.

source: Type & Description
ko: 유형 및 설명

source: Types of use allowed (commercial / non-commercial, distribution, derivative works / to make, have made, manufacture)
ko: 허용된 사용 유형 (상업적 / 비상업적, 배포, 파생 저작물 / 제조)

source: Typical obligations of a permissive FOSS license are that the copyright notice and warranty disclaimer are included with the software.
ko: Permissive FOSS 라이선스의 일반적인 의무는 저작권 고지 및 보증 면책 조항을 소프트웨어에 포함하는 것입니다.

source: Under disjunctive licensing you have a choice of licensing, i.e. GPL and a more permissive license option, you may choose which license you are going to distribute under depending on license compatibility, license requirements.
ko: 선택형 라이선싱하에서는 라이선스를 선택(즉, GPL 및 보다 permissive한 라이선스 옵션)할 수 있으므로, 라이선스 양립가능성, 라이선스 요구사항에 따라 배포할 라이선스를 선택할 수 있습니다.

source: Under some FOSS licenses, modifications may cause additional obligations upon distribution, such as:
ko: 어떤 FOSS 라이선스하에서는 수정으로 배포시에 다음과 같은 추가 의무가 발생할 수 있다:

source: Unplanned inclusion of copyleft FOSS into proprietary or 3rd party code:
ko: 계획없이 Copyleft FOSS를 독점 또는 제3자 코드에 포함:

source: Unplanned linking of copyleft FOSS and proprietary source code:
ko: Copyleft FOSS와 독점 소스 코드와의 계획하지 않은 링킹:

source: User Space
ko: 사용자 영역

source: Utilizing
ko: 활용 (Utilizing)

source: Validate compliance with license obligations
ko: 라이선스 의무 준수 인증

source: Verification
ko: 검증

source: Verification – Provide oversight for compliance process.
ko: 확인 - 컴플라이언스 프로세스에 대한 감독을 제공합니다.

source: Verifications
ko: 확인

source: Verifications prior to release should check to ensure the proper source code is provided with the binary release.
ko: 출시 전에 확인 단계에서는 바이너리 출시와 함께 적절한 소스 코드가 제공되는지가 보장되도록 확인해야 합니다.

source: Verified Distributed Compliance Artifacts are appropriately provided
ko: 확인된 배포할 컴플라이언스 결과물이 적절하게 제공됩니다.

source: Verify FOSS packages destined for distribution have been identified and approved
ko: 배포할 FOSS 패키지가 식별되고 승인되었는지 확인한다.

source: Verify accompanying source code (if any) has been uploaded or distributed correctly
ko: 동반 소스 코드 (있을 경우)가 올바르게 업로드 또는 배포되었는지 확인한다.

source: Verify all appropriate notices have been included to inform end-users of their right to request source code for identified FOSS
ko: 최종 사용자에게 식별된 FOSS에 대한 소스 코드를 요청할 수 있는 권리를 알리기 위한 모든 적절한 고지 사항이 포함되어 있는지 확인한다.

source: Verify appropriate notices are provided
ko: 적절한 고지 제공 검증

source: Verify compliance on a product-by-product basis: Just because a FOSS package is approved for use in one product does not necessarily mean it will be approved for use in a second product
ko: 제품별로 컴플라이언스 여부를 확인합니다: FOSS 패키지가 한 제품에서 사용하도록 승인되었다고 해서 반드시 두번째 제품에서도 사용하도록 승인된 것은 아니다.

source: Verify compliance with other identified obligations
ko: 식별된 다른 의무를 준수하는지 확인한다.

source: Verify notices have been properly published and made available
ko: 고지가 올바르게 공표되고 사용 가능하게 되었는지 확인한다.

source: Verify other identified obligations are met
ko: 기타 식별된 의무가 충족되었는지 확인한다.

source: Verify source code packages for distribution
ko: 배포용 소스 코드 패키지 검증

source: Verify that distributed software has been reviewed and approved
ko: 배포되는 소프트웨어가 리뷰되고 승인되었는지 확인한다.

source: Verify the information necessary to satisfy FOSS obligations
ko: FOSS 의무를 이행하는데 필요한 정보를 확인.

source: Verify the reviewed source code matches the binary equivalents shipping in the product
ko: 리뷰된 소스 코드가 제품에 탑재된 바이너리와 일치하는지 확인한다.

source: Verify uploaded or distributed source code corresponds to the same version that was approved
ko: 업로드되거나 배포된 소스 코드가 승인된 버전과 동일한 것인지 확인한다.

source: Version
ko: 버전

source: Very often, the license would expressly prohibits users from using the author's name without permission.
ko: 매우 자주, 이 라이선스는 사용자가 허가없이 저자의 이름을 사용하는 것을 명시적으로 금지합니다.

source: Welcome to the OpenChain Curriculum Slides.
ko: OpenChain 커리큘럼 슬라이드에 오신 것을 환영합니다.

source: What Compliance Obligations Must Be Satisfied?
ko: 어떤 컴플라이언스 의무가 충족되어야 하나?

source: What additional information is important when reviewing a FOSS component from an outside vendor?
ko: 외부 공급 업체로부터 유입된 FOSS 구성 요소를 검토 할 때 중요한 추가 정보는 무엇인가?

source: What are some benefits of a FOSS Compliance Program?
ko: FOSS 컴플라이언스 프로그램의 혜택은 무엇인가?

source: What are the benefits of maintaining a good community relationship?
ko: 커뮤니티와 좋은 관계를 유지하는 것의 이점은 무엇인가?

source: What are the benefits of prioritizing compliance?
ko: 컴플라이언스에 우선순위를 두는 것의 이점은 무엇인가?

source: What are two main goals of a FOSS Compliance Program?
ko: FOSS 컴플라이언스 프로그램의 두가지 주요 목적은 무엇인가?

source: What are typical obligations of a permissive FOSS license?
ko: Permissive FOSS 라이선스의 전형적인 의무는 무엇인가?

source: What copyright rights are most important for software?
ko: 소프트웨어에 대해 가장 중요한 저작권의 내용은 무엇인가?

source: What does FOSS compliance mean?
ko: FOSS 컴플라이언스는 무엇을 의미하는가?

source: What does an architecture review look for?
ko: 아키텍처 리뷰는 무엇을 찾기 위한 것인가?

source: What does license reciprocity mean?
ko: 라이선스 상호성은 무슨 의미인가?

source: What factors are important in assessing a distribution?
ko: 배포인지를 평가하는데 중요한 요소는 무엇인가?

source: What format for delivery?
ko: 어떤 형태로 전달되는가?

source: What information do you need to gather?
ko: 어떤 정보를 수집해야하는가?

source: What information helps identify who is licensing the software?
ko: 누가 소프트웨어 라이선스를 부여했는지 식별하는데 도움이 되는 정보는 무엇인가?

source: What information may you find in FOSS Notices, and how may the notices be used?
ko: FOSS 고지에서 어떤 정보를 찾을 수 있는가? 그 고지는 어떻게 이용되는가?

source: What is Intellectual Property?
ko: 지식 재산권이란 무엇인가?

source: What is a FOSS license?
ko: 무엇이 FOSS 라이선스인가?

source: What is a multi-license?
ko: 다중-라이선스는 무엇인가?

source: What is incorporation?
ko: 편입이란 무엇인가?

source: What is involved in compliance due diligence (for our example process, describe the steps at a high level)?
ko: 컴플라이언스 실사 (Due Diligence)에 관여된 것은 무엇인가 (예시 프로세스에서 높은 수준에서의 단계를 설명하시오)?

source: What is linking?
ko: 링킹이란 무엇인가?

source: What is modification?
ko: 수정이란 무엇인가?

source: What is the OpenChain Curriculum?
ko: OpenChain 커리큘럼이란?

source: What is the first action you should take if you want to use FOSS components?
ko: FOSS 컴포넌트를 사용하고자 할 때 취해야 할 첫 번째 액션은 무엇인가?

source: What is the format for delivery?
ko: 전달하는 형태는 무엇입니까?

source: What is the purpose of a FOSS Review?
ko: FOSS 리뷰의 목적은 무엇인가?

source: What is translation?
ko: 번역이란 무엇인가?

source: What is “Intellectual Property”?
ko: "지식 재산권"이란 무엇인가?

source: What kinds of information might you collect for a FOSS review?
ko: FOSS 리뷰를 위해 어떤 종류의 정보를 수집하는가?

source: What needs to be distributed for code used under a copyleft license?
ko: Copyleft 라이선스하에서 사용되는 코드에 대해서는 무엇이 배포되어야 하는가?

source: What rights does a patent give to the patent owner?
ko: 특허가 특허 소유자에게 부여하는 권리는 무엇인가?

source: What risks should you address with in-bound software?
ko: 유입되는 소프트웨어에 대하여 어떠한 위험에 대해 다뤄야 하는가?

source: What should you do if you have a question about using FOSS?
ko: FOSS 사용에 관한 질문이 있으면 무엇을 해야 하는가?

source: What steps can be taken to assess the quality of information collected in a FOSS Review?
ko: FOSS 리뷰에서 수집한 정보의 품질을 평가하기 위해 어떤 단계를 수행할 수 있는가?

source: What type of material does copyright law protect?
ko: 저작권법은 어떤 유형의 대상을 보호하는가?

source: What types of pitfalls can occur in FOSS compliance?
ko: FOSS 컴플라이언스에서 어떤 유형의 함정이 발생할 수 있는가?

source: When analyzing FOSS usage, collect information about the identity of the FOSS component, its origin, and how the FOSS component will be used.
ko: FOSS 사용을 분석할 때, FOSS 컴포넌트의 정체, 출처 및 FOSS 컴포넌트가 어떻게 사용될지에 대한 정보를 수집하시오.

source: When thinking about distribution of Open Source you should consider to things:
ko: 오픈소스의 배포에 대해 생각할 때 다음 사항을 고려해야 합니다.

source: When you upgrade the version of a FOSS package, make sure that the license of the new version is the same as the license of the older used version (license changes can occur between version upgrades)
ko: FOSS 패키지의 버전을 업그레이드할 때 새 버전의 라이선스가 이전에 사용된 버전의 라이선스와 동일한지 확인한다.(버전 업그레이드간에 라이선스 변경이 발생할 수 있다.)

source: While avoiding the pitfalls described in this chapter may take resources and effort, prioritizing the FOSS compliance process is important.
ko: 이 장에서 설명한 함정을 예방하는 것에는 자원과 노력이 필요한 반면, FOSS 컴플라이언스를 우선시하는 것이 중요합니다.

source: Who are the decision makers about FOSS usage (managers, architects, individual engineers, etc.)?
ko: FOSS 사용에 대한 의사 결정자는 누구입니까 (관리자, 아키텍트, 개별 엔지니어 등)?

source: Who receives the software?
ko: 누가 소프트웨어를 받는가?

source: Work
ko: 작업

source: Working through the FOSS Review
ko: FOSS 리뷰를 통한 작업

source: Written Offer
ko: 서면 청약

source: You can deliver these slides as one half-day training session or you can deliver each chapter as a separate module.
ko: 이 슬라이드를 하루 반일 교육 세션으로 사용하거나 각 장을 별도의 모듈로 사용할 수 있습니다.

source: You can get an example FOSS policy via the Linux Foundation Open Compliance Program at: https://www.linux.com/publications/generic-foss-policy
ko: https://www.linux.com/publications/generic-foss-policy 에 게시된 Linux Foundation Open Compliance Program에서 FOSS 정책의 예시를 얻을 수 있다.

source: You can get detailed checklists for these items here: https://www.linuxfoundation.org/projects/opencompliance/self-assessment-compliance-checklist
ko: 이 항목에 대한 자세한 체크리스트는 여기서 받을 수 있음: https://www.linuxfoundation.org/projects/opencompliance/self-assessment-compliance-checklist

source: You may also need to provide notices regarding modifications, or full copies of the license.
ko: 귀하는 또 수정에 관한 고지와 또는 라이선스의 전체사본을 제공할 필요가 있다.

source: You may also want to obtain copyright and attribution notices, and source code for vendor modifications if these are needed to satisfy license obligations for FOSS licenses governing the third party software.
ko: 또한 외부 공급 업체의 소프트웨어에 적용된 FOSS 라이선스에 대한 라이선스 의무를 충족하기 위해 필요한 경우, 저작권 및 귀속에 관한 고지, 공급 업체의 수정 소스 코드를 얻을 수 있습니다.

source: You must cause any work that you distribute or publish, that in whole or in part contains or is derived from the Program or any part thereof, to be licensed […] under the terms of this License.
ko: 배포하거나 공표하려는 저작물의 전부 또는 일부가 대상 프로그램의 일부를 포함하거나 대상 프로그램으로부터 파생된 것이라면, 본 라이선스의 규정에 따라 […] 의 사용허락을 해야 한다.

source: Your FOSS compliance process is a building block to establishing good working relationships within the FOSS community.
ko: FOSS 컴플라이언스 프로세스는 FOSS 커뮤니티 내에서 올바른 협력 관계를 구축하기 위한 기본 요소(building block)입니다.

source: [Insert Components]
ko: [컴포넌트 추가]

source: [Insert interaction method]
ko: [상호작용 방법 추가]

source: a result of linking software with conflicting or incompatible licenses.
ko: 이러한 유형의 실패는 소프트웨어를 충돌하거나 양립가능하지 않는 라이선스와 링킹한 결과로 발생합니다.

source: as required by the FOSS license (or providing information about modifications which has an insufficient level of detail or clarity to satisfy the license)
ko: FOSS 라이선스가 요구하는 대로 FOSS 소스 코드의 변경 사항을 표시하는 것의 실패 (또는 자세함과 명확성에 있어서 라이선스를 만족시키기에 불충분한 수준의 수정에 대한 정보 제공)

source: avoided by ensuring that the
ko: 이러한 유형의 실패는 FOSS 교육이 직원의 전문 개발 계획의 일부임을 보장하고 성과 리뷰의 일환으로 완료 여부를 모니터링함으로써 방지할 수 있다.

source: avoided by:
ko: 이러한 유형의 실패는 다음과 같은 방법으로 피할 수 있다:

source: code into copyleft FOSS through
ko: 소스 코드 수정을 통해 독점 코드를 Copyleft FOSS에 포함

source: discovered by scanning or auditing the source code for possible
ko: 이러한 유형의 오류는 다음과 일치하는 소스 코드를 스캔하거나 검사하여 발견할 수 있다:

source: discovered using a
ko: 이러한 유형의 실패는 서로 다른 컴포넌트간의 링킹을 보여주는 종속성 추적 도구(dependency tracking tool)를 사용하여 발견할 수 있다.

source: discovered using the audits or scans to identify and analyze the source code you introduced to the FOSS component.
ko: 이러한 유형의 실패는 검사 또는 스캔을 사용하여 FOSS 컴포넌트에 도입한 소스 코드를 식별하고 분석하여 발견할 수 있다.

source: g., “All of the code and documentation in this software has been dedicated to the public domain by the authors.”
ko: “이 소프트웨어안의 모든 코드와 문서는 저작자가 퍼블릭 도메인에 제공한다.”

source: identification
ko: 식별

source: prevented by implementing blocks in approvals in the FOSS compliance process
ko: 이런 유형의 실패는 FOSS 컴플라이언스 프로세스 내 승인 과정에서 블럭을 구현함으로써 예방할 수 있다.

source: prevented by mandating
ko: 이러한 유형의 실패는 엔지니어링 직원이 특정 날짜까지 FOSS 교육을 받도록 요구함으로써 예방할 수 있다.

source: prevented by:
ko: 이러한 유형의 오류는 다음과 같은 방법으로 예방할 수 있다:

source: prevented through education
ko: 이러한 유형의 실패는 교육을 통해 예방할 수 있다.

source: step into the compliance process to ensure that source code for modifications are published, rather than only the original source code for the FOSS component
ko: 이러한 유형의 실패는 FOSS 컴포넌트의 원본 소스 코드가 아닌 수정 소스 코드가 공개되고 있음을 보장하기 위한 확인 단계를 컴플라이언스 프로세스에 추가함으로 방지할 수 있다.

source: step into the compliance process to ensure that the accompanying source code for the binary version is being published.
ko: 이러한 유형의 실패는 바이너리 버전에 맞는 동반하는 소스 코드가 공개되고 있음을 보장하기 위한 확인 단계를 컴플라이언스 프로세스에 추가함으로 방지할 수 있다.

source: – and –
ko: – 그리고 –

source: “ dual ” = confusing term that may be used for any of these situations, but usually refers to business model of OSS license or commercial license choice
ko: “ 듀얼 ” = 혼란스러운 용어로 어떤 상황에서도 사용될 수 있지만, 일반적으로 OSS 라이선스와 상용 라이선스 선택의 비즈니스 모델을 나타냅니다.

source: “Hits” from the audit or scan are reviewed and verified as to the proper origin of the code
ko: 검사 또는 스캔을 통한 "히트 (Hits)"가 리뷰되고 코드의 적절한 출처에 대해 확인됨.

source: “Non-commercial” – some licenses have most of the characteristics of a FOSS license, but are limited to non-commercial use (e.g. CC-BY-NC).
ko: “비상업적” – 어떤 라이선스들은 FOSS 라이선스의 특성의 대부분을 갖고 있지만 비상업적 용도에 제한된다(예. CC-BY-NC).
